//WeLink
const char bAPDU_WeLink[][53] ={
/*-----------------------------------------------------
//"卡片的文件结构如下：	
		output("—MF═╗                              ┏ 主控密钥");	
		output("      ‖                              ┃ 应用维护密钥");	
		output("      ‖                              ┃ 外部认证密钥");	
		output("      ‖═══════KEY文件（FID=0000）————┃ 内部认证密钥");	
		output("      ‖                              ┃ PIN密钥");	
		output("      ‖                              ┗ PIN重装密钥");
		output("      ‖");	
		output("      ‖");
		output("      ‖");	
		output("      ‖══ADF═╗   （FID=0xADF2，名称=“WeLink”）");		
		output("                 ‖");		
		output("                 ‖                              ┏ 主控密钥");		
		output("                 ‖                              ┃ 应用维护密钥");	
		output("                 ‖                              ┃ 外部认证密钥");	
		output("                 ‖═══════KEY文件（FID=0000）————┃ 内部认证密钥");	
		output("                 ‖                              ┃ PIN密钥");	
		output("                 ‖                              ┗ PIN重装密钥");
		output("                 ‖");	
		output("                 ‖═══════SM2公钥文件0211");	
		output("                 ‖═══════SM2私钥文件0212");	
		output("                 ‖");	
		output("                 ‖═══════二进制文件EF11");	
		output("                 ‖═══════二进制文件EF12");	
-----------------------------------------------------*/
//创建ADF1目录以及KEY文件，在创建ADF1前，请先计算好需要用到的空间大小，尽量预留空间大一些。
//创建ADF   FID=ADF_FID，空间=0x002000，建立权限=F2，擦除权限=F2，名称=ADF_NAME	
{"98E0ADF21418002000F2F2FFFFFFFFFFFFFFFF57654C696E6B"},
//创建KEY文件
{"98E0 0000081F10FFF0F2FFFFFF"},
		 
//========装载KEY 初次个人化时可以明文装KEY；但是装载完成后如果要更新需按照KEY文件的权限和线路保护方式进行
//SM4版密钥
//1、明文装载MK  
{"B8D4000115F0F20401FF436F7265536869656C644D5478303131"},

//2、明文装载DAMK   版本（索引）=01，算法=04（SM4），重试次数10
{"B8D4010115F0F204FFAA4144463144414D4B4144463144414D4B"},
				
//3、明文装载ITK   版本（索引）=01，算法=04（SM4）
{"B8D4030115F0F204FFFF414446312D49544B414446312D49544B"},
				
//4、明文装载ETK   版本（索引）=01，算法=04（SM4），后续状态02，重试次数10
{"B8D4020115F0F20402AA414446312D45544B414446312D45544B"},
				
//5、明文装载PIN   PIN=313233343536，后续状态01，重试次数3
{"B8D40A0115F0F1FF0133313233343536FFFFFFFFFFFFFFFFFFFF"},
				
//6、明文装载RPK   版本（索引）=01，算法=04（SM4），重试次数10
{"B8D4080115F0F204FFAA414446312D52504B414446312D52504B"},
		//========装载KEY 结束				
				
//一、ADF下SM2公私钥文件的建立	
//创建SM2公钥文件FID=0211
{"98E00211081AFFFFF0F1FFFFFF"},
		//创建SM2私钥文件FID=0212
{"98E00212081BFFFFF0F1FFFFFF"},
		//生成SM2公私钥对,公钥文件FID=0211,私钥文件FID=0212
{"9840000108C0020211C2020212"},
		//二、二进制文件
		//1.创建二进制文件    FID=0xEF11，空间=0x80，读权限F0，写权限F1，读写都无线路保护，SFI=0x11
{"98E0EF1108080080F0F100FF11"},				
		//2.创建二进制文件    FID=0xEF12，空间=0x80，读权限F0，写权限F1，读写都无线路保护，SFI=0x12
{"98E0EF1208080080F0F100FF12"},	

};