//MF
const char bAPDU_MF[][53] ={

/*-----------------------------------------------------
//"卡片初始化的文件结构如下：	
				output("———MF═══╗             ┏ 主控密钥");	
				output("        ‖             ┃ 应用维护密钥");	
				output("        ‖             ┃ 外部认证密钥");	
				output("        ‖═══KEY文件-——┃ 内部认证密钥");	
				output("        ‖             ┃ PIN密钥");	
				output("        ‖             ┗ PIN重装密钥");
-----------------------------------------------------*/

			//创建MF，空间MAX（COS预留最大空间） = 0xE1000（900*1024）
{"98E03F000E18FFFFFFF2F2FFFFFFFFFFFFFFFF"},

		//创建KEY文件，预留8个KEY
{"98E00000081F08FFFFFFFFFFFF"},
		 
		//装载KEY 可以明文装KEY
		//1、明文装载MK   MK=“SAMCOS”，重试次数10
{"B8D4000115F0F204FFAA436F7265536869656C6453414D434F53"},

		//2、明文装载DAMK   DAMK=“DAMKDAMKDAMKDAMK”，重试次数10
{"B8D4010115F0F104FFAA44414D4B44414D4B44414D4B44414D4B"},
				
		//3、明文装载ITK   版本（索引）=01，算法=04（SM4）
{"B8D4030115F0F204FFFF4D462D49544B4D462D49544B4D462D49"},
				
		//4、明文装载ETK   版本（索引）=01，算法=04（SM4），后续状态02，重试次数10
{"B8D4020115F0F20402AA4D462D45544B4D462D45544B4D462D45"},
				
		//5、明文装载PIN   PIN=313233343536，后续状态02，重试次数3
{"B8D40A0115F0F1FF0133313233343536FFFFFFFFFFFFFFFFFFFF"},
				
		//6、明文装载RPK   版本（索引）=01，算法=04（SM4），重试次数10
{"B8D4080115F0F204FFAA4D462D52504B4D462D52504B4D462D52"},	

};
